In [1]:
import pandas as pd
import numpy as np

In [3]:
lista = [['BRASIL','BRASIL','BRASIL','EUA','EUA','EUA'],['2017','2018','2019','2017','2018','2019']]

In [4]:
tuplas = zip(*lista)

In [6]:
tuplas

In [8]:
tuplas = list(tuplas)

In [9]:
tuplas

[('BRASIL', '2017'),
 ('BRASIL', '2018'),
 ('BRASIL', '2019'),
 ('EUA', '2017'),
 ('EUA', '2018'),
 ('EUA', '2019')]

In [10]:
multi = pd.MultiIndex.from_tuples(tuplas)

In [12]:
multi

MultiIndex([('BRASIL', '2017'),
            ('BRASIL', '2018'),
            ('BRASIL', '2019'),
            (   'EUA', '2017'),
            (   'EUA', '2018'),
            (   'EUA', '2019')],
           )

In [13]:
df1 = pd.DataFrame(data=np.random.randn(6,2), index=multi, columns=['EXP TRIGO','EXP ARROZ'])

In [15]:
df1

             EXP TRIGO  EXP ARROZ
BRASIL 2017  -0.606636  -0.677082
       2018   1.282613   0.700863
       2019  -1.112375  -0.257761
EUA    2017  -0.220667   0.942333
       2018   0.512241   1.479796
       2019  -0.638018  -0.497122

In [16]:
df1.index.names = ['PAÍS','ANO']

In [18]:
df1

             EXP TRIGO  EXP ARROZ
PAÍS   ANO
BRASIL 2017  -0.606636  -0.677082
       2018   1.282613   0.700863
       2019  -1.112375  -0.257761
EUA    2017  -0.220667   0.942333
       2018   0.512241   1.479796
       2019  -0.638018  -0.497122

In [19]:
# encontrando valores

In [21]:
df1['EXP ARROZ']

PAÍS    ANO
BRASIL  2017   -0.677082
        2018    0.700863
        2019   -0.257761
EUA     2017    0.942333
        2018    1.479796
        2019   -0.497122
Name: EXP ARROZ, dtype: float64

In [23]:
df1.loc['BRASIL']

      EXP TRIGO  EXP ARROZ
ANO
2017  -0.606636  -0.677082
2018   1.282613   0.700863
2019  -1.112375  -0.257761

In [33]:
df1.xs('2017', level=1)

        EXP TRIGO  EXP ARROZ
PAÍS
BRASIL  -0.606636  -0.677082
EUA     -0.220667   0.942333

In [35]:
df1[:5]

             EXP TRIGO  EXP ARROZ
PAÍS   ANO
BRASIL 2017  -0.606636  -0.677082
       2018   1.282613   0.700863
       2019  -1.112375  -0.257761
EUA    2017  -0.220667   0.942333
       2018   0.512241   1.479796

In [37]:
df1[['EXP TRIGO','EXP ARROZ']]

             EXP TRIGO  EXP ARROZ
PAÍS   ANO
BRASIL 2017  -0.606636  -0.677082
       2018   1.282613   0.700863
       2019  -1.112375  -0.257761
EUA    2017  -0.220667   0.942333
       2018   0.512241   1.479796
       2019  -0.638018  -0.497122

In [38]:
# vendo o dataframe de outra maneira, usando o unstack

In [40]:
df1.unstack()

       EXP TRIGO                     EXP ARROZ
ANO         2017      2018      2019      2017      2018      2019
PAÍS
BRASIL -0.606636  1.282613 -1.112375 -0.677082  0.700863 -0.257761
EUA    -0.220667  0.512241 -0.638018  0.942333  1.479796 -0.497122

In [43]:
df2 = df1.unstack()

In [45]:
df2

       EXP TRIGO                     EXP ARROZ
ANO         2017      2018      2019      2017      2018      2019
PAÍS
BRASIL -0.606636  1.282613 -1.112375 -0.677082  0.700863 -0.257761
EUA    -0.220667  0.512241 -0.638018  0.942333  1.479796 -0.497122

In [48]:
df2.xs('2017',axis=1,level=1)

        EXP TRIGO  EXP ARROZ
PAÍS
BRASIL  -0.606636  -0.677082
EUA     -0.220667   0.942333